zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/misc/renesas/ra-elc/ra6m1-elc.h
#define RA_ELC_EVENT_SPI0_IDLE                 0x1BE /**< Idle. */
#define RA_ELC_EVENT_SPI0_ERI                  0x1BF /**< Error. */
#define RA_ELC_EVENT_SPI0_TEI                  0x1C0 /**< Transmission complete event. */
#define RA_ELC_EVENT_SPI1_RXI                  0x1C1 /**< Receive buffer full. */
#define RA_ELC_EVENT_SPI1_TXI                  0x1C2 /**< Transmit buffer empty. */
#define RA_ELC_EVENT_SPI1_IDLE                 0x1C3 /**< Idle. */
#define RA_ELC_EVENT_SPI1_ERI                  0x1C4 /**< Error. */
#define RA_ELC_EVENT_SPI1_TEI                  0x1C5 /**< Transmission complete event. */
#define RA_ELC_EVENT_QSPI_INT                  0x1C6 /**< QSPI interrupt. */
#define RA_ELC_EVENT_SDHIMMC0_ACCS             0x1C7 /**< Card access. */
#define RA_ELC_EVENT_SDHIMMC0_SDIO             0x1C8 /**< SDIO access. */
#define RA_ELC_EVENT_SDHIMMC0_CARD             0x1C9 /**< Card detect. */
#define RA_ELC_EVENT_SDHIMMC0_DMA_REQ          0x1CA /**< DMA transfer request. */
#define RA_ELC_EVENT_SDHIMMC1_ACCS             0x1CB /**< Card access. */
#define RA_ELC_EVENT_SDHIMMC1_SDIO             0x1CC /**< SDIO access. */
#define RA_ELC_EVENT_SDHIMMC1_CARD             0x1CD /**< Card detect. */
#define RA_ELC_EVENT_SDHIMMC1_DMA_REQ          0x1CE /**< DMA transfer request. */

/* Renesas RA ELC peripherals that can be linked to event signals. */
#define RA_ELC_PERIPHERAL_GPT_A   0  /**< General PWM Timer A */
#define RA_ELC_PERIPHERAL_GPT_B   1  /**< General PWM Timer B */
#define RA_ELC_PERIPHERAL_GPT_C   2  /**< General PWM Timer C */
#define RA_ELC_PERIPHERAL_GPT_D   3  /**< General PWM Timer D */
#define RA_ELC_PERIPHERAL_GPT_E   4  /**< General PWM Timer E */
#define RA_ELC_PERIPHERAL_GPT_F   5  /**< General PWM Timer F */
#define RA_ELC_PERIPHERAL_GPT_G   6  /**< General PWM Timer G */
#define RA_ELC_PERIPHERAL_GPT_H   7  /**< General PWM Timer H */
#define RA_ELC_PERIPHERAL_ADC0    8  /**< ADC0 */
#define RA_ELC_PERIPHERAL_ADC0_B  9  /**< ADC0 Group B */
#define RA_ELC_PERIPHERAL_ADC1    10 /**< ADC1 */
#define RA_ELC_PERIPHERAL_ADC1_B  11 /**< ADC1 Group B */
#define RA_ELC_PERIPHERAL_DAC0    12 /**< DAC0 */
#define RA_ELC_PERIPHERAL_DAC1    13 /**< DAC1 */
#define RA_ELC_PERIPHERAL_IOPORT1 14 /**< IOPORT1 */
#define RA_ELC_PERIPHERAL_IOPORT2 15 /**< IOPORT2 */
#define RA_ELC_PERIPHERAL_IOPORT3 16 /**< IOPORT3 */
#define RA_ELC_PERIPHERAL_IOPORT4 17 /**< IOPORT4 */
#define RA_ELC_PERIPHERAL_CTSU    18 /**< CTSU */

/** @endcond */

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_MISC_RENESAS_RA_ELC_RA6M1_ELC_H_ */
